Revit 2027 API
FabricSheetAlignment Enumeration
 Fabric Sheet alignment in the fabric distribution
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricSheetAlignment
Public Enumeration FabricSheetAlignment
public enum class FabricSheetAlignment
type FabricSheetAlignment
Members
Member name | Value | Description
BothEdges | 3 |  The fabric sheets are aligned to starting and ending edge.
EndingEdge | 2 |  The fabric sheets are aligned to ending edge.
Null | 0 |  The fabric sheets are alignment is not set.
StartingEdge | 1 |  The fabric sheets are aligned to starting edge.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace